Autodesk.Revit.DB.PerformanceAdviser.GetRuleDescription(System.Int32)
Retrieves the description of the rule.
index:
The rule index to get information for.
Returns:
The description of the rule.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetRuleName(System.Int32)
Retrieves the name of the rule.
index:
The rule index to get information for.
Returns:
The name of the rule.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetElementFilterFromRule(System.Int32,Autodesk.Revit.DB.Document)
Retrieves a filter to restrict elements to be checked.
index:
The rule index to get information for.
document:
Document for which performance problems are being checked.
Returns:
The filter to restrict elements to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.WillRuleCheckElements(System.Int32)
Reports if rule needs to be executed on individual elements.
index:
The rule index to get information for.
Returns:
True if rule needs to be executed on individual elements.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetRuleDescription(Autodesk.Revit.DB.PerformanceAdviserRuleId)
Retrieves the description of the rule.
id:
The rule id to get information for.
Returns:
The description of the rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetRuleName(Autodesk.Revit.DB.PerformanceAdviserRuleId)
Retrieves the name of the rule.
id:
The rule id to get information for.
Returns:
The name of the rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetElementFilterFromRule(Autodesk.Revit.DB.PerformanceAdviserRuleId,Autodesk.Revit.DB.Document)
Retrieves a filter to restrict elements to be checked.
id:
The rule id to get information for.
document:
Document for which performance problems are being checked.
Returns:
The filter to restrict elements to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.WillRuleCheckElements(Autodesk.Revit.DB.PerformanceAdviserRuleId)
Reports if rule needs to be executed on individual elements.
id:
The rule id to get information for.
Returns:
True if rule needs to be executed on individual elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.PostWarning(Autodesk.Revit.DB.FailureMessage)
Reports a problem detected during execution of a rule.
message:
Warning describing the problem detected by a rule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The message must have severity "warning".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Performance advisor is not executing rules.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.ExecuteRules(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{System.Int32})
Executes selected rules on a given document.
Remarks:
Disabled rules are not executed.
document:
Document on which the rules will be executed.
rules:
Indices of rules to be executed.
Returns:
Failure messages explaining performance problems detected in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.ExecuteRules(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.PerformanceAdviserRuleId})
Executes selected rules on a given document.
document:
Document on which the rules will be executed.
rules:
Ids of rules to be executed.
Returns:
Failure messages explaining performance problems detected in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.ExecuteAllRules(Autodesk.Revit.DB.Document)
Executes all rules in the list on a given document.
Remarks:
Disabled rules are not executed.
document:
Document on which the rules will be executed.
Returns:
Failure messages explaining performance problems detected in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.SetRuleEnabled(Autodesk.Revit.DB.PerformanceAdviserRuleId,System.Boolean)
Retrieves an enabled/disabled status for the given rule.
id:
The rule id to set enabled/disabled status for.
enabled:
True enables the rule, false disables.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id does not correspond to any registered rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.SetRuleEnabled(System.Int32,System.Boolean)
Retrieves an enabled/disabled status for the given rule.
index:
The rule index to set enabled/disabled status for.
enabled:
True enables the rule, false disables.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is outside of acceptable range.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.IsRuleEnabled(Autodesk.Revit.DB.PerformanceAdviserRuleId)
Retrieves an enabled/disabled status for the given rule.
id:
The rule id to retrieve enabled/disabled status for.
Returns:
True if rule is disabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id does not correspond to any registered rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.IsRuleEnabled(System.Int32)
Retrieves an enabled/disabled status for the given rule.
index:
The rule index to retrieve enabled/disabled status for.
Returns:
True if rule is disabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is outside of acceptable range.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetAllRuleIds
Retrieves an enumeration of rule Ids.
Returns:
A collection of rule Ids
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetRuleId(System.Int32)
Retrieves an id of a rule for a given index in the list.
index:
The index to retrieve the rule id for.
Returns:
The rule id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is outside of acceptable range.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetNumberOfRules
Retrieves number of performance adviser rules in the list.
Returns:
Number of performance adviser rules in the list.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.DeleteRule(Autodesk.Revit.DB.PerformanceAdviserRuleId)
Deletes a performance adviser rule from the list of rules.
id:
An id of the rule to be deleted from the list of rules.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.AddRule(Autodesk.Revit.DB.PerformanceAdviserRuleId,Autodesk.Revit.DB.IPerformanceAdviserRule)
Adds a performance adviser rule to the list of rules.
id:
An id of the rule to be added to the list of rules.
rule:
The rule to be added
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.GetPerformanceAdviser
Returns the only instance of PerformanceAdviser in the Application.
Returns:
The only instance of PerformanceAdviser in the Application.
Since:
2012

Autodesk.Revit.DB.PerformanceAdviser.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PerformanceAdviser
The tool to report performance problems in a given document.
Remarks:
Class is an application-wide singleton that performs a dual role: it is a repository of rules to run
in order to detect potential performance problems as well as an access point to execute checks.
Since:
2012